app/controllers/admin/brands_controller.rb

SELECT "brands".* FROM "brands"
---
  def index
    @brands = Admin::Brand.all

INSERT INTO "brands" ("created_at", "name", "updated_at") VALUES (?, ?, ?)  [["created_at", Wed, 18 Sep 2013 11:20:12 UTC +00:00], ["name", "Bare"], ["updated_at", Wed, 18 Sep 2013 11:20:12 UTC +00:00]]
SELECT "brands".* FROM "brands"
---
  def create
    @brand = Admin::Brand.new(params[:admin_brand])

    respond_to do |format|
      if @brand.save
        @brands = Admin::Brand.all