app/controllers/admin/categories_controller.rb

  def index
    @categories = Admin::Category.all
---
SELECT "categories".* FROM "categories"

  def create
    @category = Admin::Category.new(params[:admin_category])

    respond_to do |format|
      if @category.save
        @categories = Admin::Category.all
---
INSERT INTO "categories" ("created_at", "name", "updated_at") VALUES (?, ?, ?)  [["created_at", Wed, 18 Sep 2013 09:47:17 UTC +00:00], ["name", nil], ["updated_at", Wed, 18 Sep 2013 09:47:17 UTC +00:00]]
SELECT "categories".* FROM "categories"

  def show
    @category = Admin::Category.find(params[:id])
---
SELECT "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT 1  [["id", "2"]]