app/controllers/admin/products_controller.rb

SELECT "brands".* FROM "brands"
SELECT "categories".* FROM "categories"
---
  def new
    @product = Admin::Product.new
    @brands = Admin::Brand.all
    @categories = Admin::Category.all

SELECT "products".* FROM "products"
---
  def index

    p @products = Admin::Product.all

INSERT INTO "products" ("brand_id", "category_id", "color", "created_at", "description", "gender", "image", "material_type", "name", "price", "size", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create

    @product = Admin::Product.new(params[:admin_product])
    @product.brand_id = params[:brand]
    @product.category_id = params[:category][:category_id]
    @product.size = params[:size]
    @product.color = params[:color]
    @product.gender = params[:gender]
    respond_to do |format|

      if  @product.save

SELECT "products".* FROM "products" WHERE "products"."id" = ? LIMIT 1  [["id", "1"]]
---
  def show
    @product = Admin::Product.find(params[:id])

SELECT "products".* FROM "products" WHERE "products"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "brands".* FROM "brands"
SELECT "categories".* FROM "categories"
---
  def edit
    @product = Admin::Product.find(params[:id])
    @brands = Admin::Brand.all
    @categories = Admin::Category.all

SELECT "products".* FROM "products" WHERE "products"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "products" SET "brand_id" = 2, "category_id" = NULL, "size" = NULL, "color" = NULL, "updated_at" = '2013-09-23 12:19:04.726207' WHERE "products"."id" = 1
---
   def update
     @product = Admin::Product.find(params[:id])
     @product.brand_id = params[:brand]
     @product.category_id = params[:category]
     @product.size = params[:size]
     @product.color = params[:color]
     @product.gender = params[:gender]
     p @product
     p '-----------------------------------------------------'
     respond_to do |format|
       if @product.update_attributes(params[:admin_product])