app/views/users/_assign_roles.html.erb

SELECT "roles".* FROM "roles"
SELECT 1 AS one FROM "roles" INNER JOIN "roles_users" ON "roles"."id" = "roles_users"."role_id" WHERE "roles_users"."user_id" = 1 AND "roles"."id" = 1 LIMIT 1
---
    <div>
      <%= check_box_tag 'role_id[]', role.id, @user.roles.include?(role) %>  <%= role.name %>