app/views/role_users/new.html.erb

      <%= f.label :Role %>
      <%= collection_select(:roleuser, :roles_id, Role.all, :id, :name) %>
---
SELECT "roles".* FROM "roles"
SELECT "users".* FROM "users"