app/views/admin/products/_form.html.erb

          <td><%= f.label :brand %></td>
          <td><%= collection_select(:product, :brand_id, Brand.all, :id, :name) %></td>
---
SELECT "brands".* FROM "brands"

          <td><%= f.label :category %></td>
          <td><%= collection_select(:product, :category_id, Category.all, :id, :name) %></td>
---
SELECT "categories".* FROM "categories"