app/controllers/role_users_controller.rb

  def index
    @roleusers = RoleUser.all
---
SELECT "role_users".* FROM "role_users"

  def create
    @roleuser = RoleUser.new(params[:roleuser])

    p @roleuser
    p '+++++++++++++++++++++++++++++++++++++++++++++++++++'
    respond_to do |format|
      if @roleuser.save
---
INSERT INTO "role_users" ("created_at", "roles_id", "updated_at", "users_id") VALUES (?, ?, ?, ?)  [["created_at", Sat, 21 Sep 2013 11:29:28 UTC +00:00], ["roles_id", 1], ["updated_at", Sat, 21 Sep 2013 11:29:28 UTC +00:00], ["users_id", 1]]