app/controllers/users_controller.rb

  def add_roles
    @user = User.find(params[:id])
    @roles = Role.all
---
SELECT "users".* FROM "users" WHERE "users"."id" = 2 LIMIT 1
SELECT "roles".* FROM "roles"

  def assign_roles
    @user = User.find(params[:id])
    @user.roles.clear
    params[:role_id].each do |role_id|

      @user.roles << Role.find(role_id)


    end
    respond_to do |format|
      if @user.save
        @users = User.all
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "roles".* FROM "roles" INNER JOIN "roles_users" ON "roles"."id" = "roles_users"."role_id" WHERE "roles_users"."user_id" = 1
SELECT "users".* FROM "users"